           05 recordId      pic 9(9) comp-5.
           05 recordName    pic x(30).
           05 recordFamily  pic x(30).
           05 recordCode    pic 9(9) comp-5.
           05 recordCity    pic x(30).
           05 recordStreet  pic x(30).
           05 recordPhone   pic x(15).
